ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 128)
    (1-3): 3 x GCNConv(128, 128)
  )
  (gat_layers): ModuleList(
    (0-3): 4 x GATConv(128, 128, heads=1)
  )
  (spatial_attention): SpatialAttentionLayer(
    (query): Linear(in_features=128, out_features=128, bias=True)
    (key): Linear(in_features=128, out_features=128, bias=True)
    (value): Linear(in_features=128, out_features=128, bias=True)
  )
  (lin): Linear(in_features=128, out_features=5, bias=True)
)