ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 4096)
    (1-3): 3 x GCNConv(4096, 4096)
  )
  (gat_layers): ModuleList(
    (0-3): 4 x GATConv(4096, 4096, heads=1)
  )
  (lin): Linear(in_features=4096, out_features=5, bias=True)
)