ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 64)
    (1-3): 3 x GCNConv(64, 64)
  )
  (gat_layers): ModuleList(
    (0): GATConv(64, 64, heads=1)
  )
  (lin): Linear(in_features=64, out_features=5, bias=True)
)