ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 512)
    (1-3): 3 x GCNConv(512, 512)
  )
  (gat_layers): ModuleList(
    (0-3): 4 x GATConv(512, 512, heads=1)
  )
  (spatial_attention): SpatialAttentionLayer(
    (query): Linear(in_features=512, out_features=512, bias=True)
    (key): Linear(in_features=512, out_features=512, bias=True)
    (value): Linear(in_features=512, out_features=512, bias=True)
  )
  (lin): Linear(in_features=512, out_features=5, bias=True)
)