ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 768)
    (1-2): 2 x GCNConv(768, 768)
  )
  (gat_layers): ModuleList(
    (0-2): 3 x GATConv(768, 768, heads=1)
  )
  (spatial_attention): SpatialAttentionLayer(
    (query): Linear(in_features=768, out_features=768, bias=True)
    (key): Linear(in_features=768, out_features=768, bias=True)
    (value): Linear(in_features=768, out_features=768, bias=True)
  )
  (lin): Linear(in_features=768, out_features=5, bias=True)
)