ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 256)
    (1-3): 3 x GCNConv(256, 256)
  )
  (gat_layers): ModuleList(
    (0-3): 4 x GATConv(256, 256, heads=1)
  )
  (spatial_attention): SpatialAttentionLayer(
    (query): Linear(in_features=256, out_features=256, bias=True)
    (key): Linear(in_features=256, out_features=256, bias=True)
    (value): Linear(in_features=256, out_features=256, bias=True)
  )
  (lin): Linear(in_features=256, out_features=5, bias=True)
)