ConfigurableGNN(
  (gcn_layers): ModuleList(
    (0): GCNConv(776, 64)
    (1-3): 3 x GCNConv(64, 64)
  )
  (gat_layers): ModuleList(
    (0-3): 4 x GATConv(64, 64, heads=1)
  )
  (spatial_attention): SpatialAttentionLayer(
    (query): Linear(in_features=64, out_features=64, bias=True)
    (key): Linear(in_features=64, out_features=64, bias=True)
    (value): Linear(in_features=64, out_features=64, bias=True)
  )
  (lin): Linear(in_features=64, out_features=5, bias=True)
)